Repository: RaduPantelimon/CEAE
Catalog: CEAE/Translations.*.resx
Languages: ro

source: Access Denied
ro: Access interzis!

source: Account
ro: Username

# AccountNamePossible
source: Use your username instead by registering!
ro: Folosește un username în loc de email!

# AccountRequired
source: Account is required!
ro: Username-ul e obligatoriu!

source: Actions
ro: Acțiuni

source: Add New Answer
ro: Adaugă nou răspuns

# Administrator
source: User Role
ro: Rol utilizator

# AdministratorRequired
source: User Role required!
ro: Rolul utilizatorului e obligatoriu!

source: Answer
ro: Raspuns

# AnswerHasQuestionAssociatedCannotContinueRemoveAssociationAndRetry
source: Answer has a question associated. Cannot Continue. Remove association and retry.
ro: Raspunsul are cel puțin o întrebare asociată. Ștergeți asocierea mai întâi.

# AnswerIDRequired
source: Answer ID is required!
ro: ID-ul răspunsului e obligatoriu!

source: Answers
ro: Răspunsuri

source: Are you sure you want to delete this?
ro: Ești sigur că vrei să ștergi?

source: Back to List
ro: Înapoi la listă

source: Confirm Password
ro: Confirmare parolă

# ConfirmPasswordRequired
source: Confirmation Password is required!
ro: Confirmarea parolei e obligatorie!

source: Create
ro: Creează

source: Create user
ro: Creează utilizator

source: Delete
ro: Șterge

source: Details
ro: Detalii

source: Edit
ro: Modifică

source: Email address saved successfully
ro: Email-ul a fost salvat cu success!

# EmailInvalid
source: Email address is invalid!
ro: Email-ul este invalid!

# EmailRequired
source: Email address is required!
ro: Email-ul este obligatoriu!

# EmailUndefined
source: Email not set!
ro: Email-ul nu este setat!

source: First Name
ro: Prenume

# FirstNameRequired
source: First Name is required!
ro: Prenumele e obligatoriu!

source: Home
ro: Acasă

source: Image
ro: Imagine

# ImageRequired
source: Image is required!
ro: Imaginea e obligatorie!

# ImgPath
source: Avatar URL
ro: URI poză

# InvalidLogin
source: Invalid login attempt.
ro: Nu v-am putut autentifica.

source: Last Name
ro: Nume

# LastNameRequired
source: Last Name is required!
ro: Numele de familie e obligatoriu!

# LoadingTest
source: Loading the test...
ro: Se încarcă testul...

source: Log in
ro: Intră în cont

source: Log out
ro: Delogare

source: Manage Account
ro: Administrare cont

# ModelInvalid
source: Model is invalid!
ro: Modelul este invalid!

source: Mr.
ro: Dl

source: Mrs.
ro: Dra

source: Ms.
ro: Dnei

source: Next Question
ro: Următoarea întrebare

source: No
ro: Nu

source: Old Password
ro: Parola veche

# OldPasswordRequired
source: Old Password is required!
ro: Parola veche e obligatorie!

# OrOldPasswordError
source: Or Old Password is not correct!
ro: Sau parola veche nu e bună!

source: Password
ro: Parolă

# PasswordLengthRequired
source: The {0} must be at least {2} characters long.
ro: {0} trebuie să fie mai lungă de {2} caractere.

# PasswordMismatch
source: The password and confirmation password do not match.
ro: Parola și confirmarea parolei nu sunt identice!

# PasswordRequired
source: Password is required!
ro: Parola e obligatorie!

# PhoneNumber
source: Phone #
ro: Număr telefon

# PhoneNumberRequired
source: Phone Number is required!
ro: Numărul de telefon e obligatorie!

# PleaseProvideEmailAddress
source: Please provide an email address to finish this quiz!
ro: Vă rugăm să introduceți adresa de email pentru a finaliza chestionarul!

source: Please wait...
ro: Vă rugăm așteptați...

source: Previous Question
ro: Întrebarea precendentă

source: Properties
ro: Setări

source: Question
ro: Întrebare

# QuestionIDRequired
source: Question ID is required!
ro: ID-ul întrebării e obligatoriu!

source: Questions
ro: Întrebări

source: Register
ro: Înregistrare

source: Remember Me?
ro: Ține-mă minte

source: Reset Password
ro: Resetează parolă

source: Save
ro: Salvează

source: Start Test
ro: Începe testul

source: Submit
ro: Trimite

source: Submit Email
ro: Trimite email-ul

# TakeTest
source: Find Out How You Think
ro: Începe testul

# TextRequired
source: Text is required!
ro: Text-ul e obligatoriu!

source: Title
ro: Titlu

# TitleRequired
source: Title is required!
ro: Titlul e obligatoriu!

# UserIDRequired
source: User ID is required!
ro: ID-ul user-ului e obligatoriu!

source: Users
ro: Utilizatori

source: Yes
ro: Da
